# ლოგიკური ოპერატორებია and,or,not.მათ ყოველთვის ლოგიკურად გამოაქვთ პასუხი
# and-ორივე არგუმენტი უნდა იყოს True რომ დაიბეჭდოს საბოლოოდ True.სხვა ნებისმიერ შემთხვევაში დაიბეჭდება False
# or-ერთ-ერთი არგუმენტი მაინც უნდა იყოს True იმისთვის რომ დაიბეჭდოს True.False მხოლოდ იმ შემთხვევაში დაიბეჭდება
# თუ ორივე არგუმენტი False იქნება.
# not-აბრუნებს არგუმენტის საპირისპიროს


# ლუწი რიცხვები for ციკლით 1 დან 100 ამდე:
for i in range(2,100,2):
    print(i)


# Even_Or_Odd ფუნქცია
def even_or_odd(num):
    if num%2==0:return "Even"
    else:return "Odd"


# tuple
tup=(5,3,4,4,"andria",4,4,1,2,3,1)
# რამდენჯერ მეორდება 4
print(tup.count(4))
print(tup.index("andria"))


# set-განსხვავდება list ისგან იმით რომ მასში ერთნაირი წევრები არ ინახება,არ აქვს ინდექსინგი და ყოველი მისი დაპრინტვა
# სხვადასხვა რიგად დაწყობილ ელემენტებს გამოგვიტანს
s={"ad","lu","ad","2","d"}
print(s)

dictionary={
    "name":"Andria",
    "Lastname":"Shavidze"
}

print(dictionary.keys())