// global scope-ნიშნავს ისეთ შექმნილ ცვლადს რომელიც შეგვიძლია კოდის ნებისმიერ ხაზზე,ნებისმიერ ადგილას გამოვიყენოთ
const name="Andria Shavidze"
// ამ შემთხვევაში name ცვლადის გამოყენება შეგვიძლია ნებისმიერ ადგილას იქნება ეს ფუნქცია,if/else და ა.შ

// block scope-ნიშნავს ისეთ შექმნილ ცვლადს რომლის გამოყენების ესევთქვათ რადიუსი შეზღუდულია.ესეთ ცვლადებს ძირითადად
// ფუნქციებში ვხვდებით და მათ ფუნქციების გარეთ ვერ ვიყენებთ
const greet=()=>{
    const fullname="Andria Shavidze"
    return fullname
}
// fullname ცვლადი ამ შემთხვევაში თავისუფლად შეგვიძლია გამოვიყენოთ მაშინ როდესაც კოდს ფუნქციის შიგნით ვწერთ მაგრამ
// მისი გამოყენება ფუნქციის გარეთ არ შეგვიძლია

// lexical scope-ამ შემთხვევაში ცვლადზე წვდომა დამოკიდებულია არა იმაზე თუ სად წერია ის არამედ სად ვიძახებთ

