// for loop-გვაძლევს საშუალებას კოდის იტერაცია მოვახდინოთ იმდენჯერ რამდენჯერაც გვინდა
// for in-გამოაქვს ყველა ელემენტის ინდექსი ანუ 0 დან ამ მნიშვნელობის სიგრძემდე რიცხვები
// for of-გადაუვლის გადაცემულ მნიშვნელობას და გამოიტანს თითოეულ ელემენტს ცალცალკე

const name="Andria"
for (let i in name){
    console.log(i)
}

let li=[1,2,3,4,5,6,7]

for (let i of li){
    console.log(i)
    break
}

// for ციკლს ვიყენებთ მაშინ როდესაც იტერაციების რაოდენობა ვიცით ხოლო while ს მაშინ როდესაც არ ვიცით რამდენჯერ დაგვჭირდება კოდის გამეორება

let num=1
while (num<30){
    console.log(num)
    num+=2
}
let num2=1

do{
    console.log(num2)
    num2+=2
}while(num2<31)