# loop-იგივე ციკლი,ნიშნავს რაღაც მოქმედების გამეორებას.
# python-ში for loop ციკლს ვიყენებთ იმისთვის რომ რაიმე მოქმედება კომპიუტერმა რამდენჯერმე გააკეთოს.
# for loop-ციკლს ვაწვდით რიცხვს range ფუნქციის საშუალებით რაც მას ეუბნება თუ რამდენჯერ უნდა გაიმეოროს კოდი.
# range ფუნქცია იღებს 3 პარამეტრს: start(სად იწყებს), stop(სად მთავრდება) და step(რამდენი ნაბიჯით უნდა იაროს).ესეიგი range(start,stop,step)
# თუ მასში მხოლოდ ერთ რიცხვს ჩავწერთ ეს რიცხვი იქნება stop რადგან range ფუნქციაში თუ მხოლოდ ერთი რიცხვი შეგვყავს start 0-ია და step კი 1.
# თუ შევიყვანთ ორ რიცხვს ეს იქნება start და stop ხოლო step იქნება 1.
# სამი რიცხვის შემთხვევაში კი პირველი რიცხვი იქნება start, მეორე stop და მესამე step.
for i in range(100,201):
    print(i)
# ამ კოდის საშუალებით ჩვენ დავბეჭდავთ რიცხვებს 100-დან 200-ის ჩათვლით.
for i in range(20,30,3):
    print(i)
# ამ კოდის საშუალებით ჩვენ დავბეჭდავთ რიცხვებს 20-დან 30-მდე ყოველ მესამე რიცხვს.
for i in range(0,21,2):
    print(i)
# ამ კოდის საშუალებით ჩვენ დავბეჭდავთ რიცხვებს 0-დან 20-ის ჩათვლით ყოველ მეორე ანუ ყველა ლუწ რიცხვს

total=0
for i in range(5):
    number=int(input("Enter a number: "))
    total+=number
print(total/5)
# ამ კოდის საშუალებით მომხმარებელს ვთხოვთ ჩაწეროს 5 რიცხვი და შემდეგ ვბეჭდავთ ამ რიცხვების საშუალო არითმეტიკულს.