# TypeError-არასწორი მონაცემთა ტიპი მაგალითად print("5"+5)
# NameError-არასწორი ცვლადის სახელი.ხდება მაშინ როდესაც ვიყენებთ ცვლადს რომელიც არ გვაქვს შექმნილი
# IndexError-ხდება მაშინ როდესაც მაგალითად სიაში არ გვაქვს ისეთი ინდექსი რომლის გამოყენებასაც ჩვენ ვცდილობთ
# მაგალითად:list=[5,4,2] მაქსიმუმი ინდექსია 2.print(list[5])-ასეთი ინდექსი არ გვაქვს IndexError
# SyntaxError-წერის ტექნიკის/წესების დარღვევა.მაგალითად ფრჩხილების გამოტოვება
# ValueError-არასწორად გადაცემული მნიშვნელობა.მაგალითად int("andria")
# KeyError-როდესაც dictionary ში არ გვაქვს ისეთი გასაღები რომლის გამოტანასაც ვცდილობთ
# ZeroDivisionError-ნულზე გაყოფის error.ხდება მაშინ როდესაც კოდში გვაქვს რიცხვის ნულზე გაყოფის შემთხვევა
a=5
b=0
try:
    print(a/b)
except ZeroDivisionError:
    print("0-ზე გაყოფა არ შეიძლება!")