year = int(input("Please enter the year: "))
if year%4==0 and year%100!=0 or year%400==0:
    print("ეს წელი ნაკიანია")
else:
    print("ეს წელი არაა ნაკიანი")

# # /-ჩვეულებრივი გაყოფა რომელიც რიცხვს ყოფს მეორე რიცხვზე და შედეგად გამოაქვს მათი განაყოფი float ტიპის მონაცემად.
print(10/2)
print(1421/124)
print(2381/214)
# //-თუ რიცხვი ბოლომდე არ იყოფა მეორე რიცხვზე /-გან განსხვავებით ის არ გამოიტანს ათწილადს,ის მხოლოდ 
# იმ რიცხვს გამოიტანს რამდენჯერაც გასაყოფში გამყოფი ჯდება.გამოაქვს integer ტიპის მონაცემი.
print(10//5)
print(1230//24)
print(2131824//21412)
# %-აკეთებს //-ის საპირისპიროს.შედეგად გამოაქვს გაყოფისგან დარჩენილი ნაშთი.თუ გასაყოფი გამყოფზე ზუსტად ნაშთის
# გარეშე იყოფა პასუხს ნულს გამოიტანს,თუ არა გამოიტანს დარჩენილს ნაშთს.გამოაქვს ყოველთვის integer ტიპის მონაცემი.
print(10%2)
print(213124%123)
print(1244214%12341)
# elif(else if)-ამატებს სხვა შესაძლო შემთხვევას if ის და else ის გარდა.გამოიყენება შემთხვევებში როდესაც
# გვინდა არა ერთი შესაძლო შემთხვევა და დანარჩენი სხვა შემთხვევები გვქონდეს არამედ რამდენიმე შესაძლო ვარიანტი.