// სინქრონიზაცია(Synchronous) - სინქრონიზირებული პროგრამირების დროს მოქმედებები ხდება მიმდევრობით ანუ თითო კოდი თავის ჯერს ელოდება და არ სრულდება სანამ მისი წინა კოდები არ შესრულდება.ანუ პროგრამა შედარებით დალაგებულად მუშაობს


console.log("Hello")
console.log("World")
console.log("Hello World")


// მაგალითად ამ კოდში თითოეული ხაზი ელოდება თავის რიგს ანუ კონსოლში ჯერ Hello დაიბეჭდება,შემდეგ World და საბოლოოდ Hello World რადგან სწორედ ამ მიმდევრობით წერია ის და ის მუშაობს სინქრონიზირებულად


// ასინქრონიზაცია(Asynchronous) - ასინქრონიზირებული პროგრამირების დროს კი მოქმედებები არარის ყოველთვის დალაგებული და ისინი რიგის მიხედვით არ სრულდებიან.თუ სინქრონიზაციის დროს კოდი მანამ არ გაეშვებოდა სანამ წინა არ მორჩებოდა ასინქრონიზაციის შემთხვევაში არარის საჭირო რომ წინა ხაზი დასრულებული იყოს იმისთვის რომ კოდი გაეშვას


console.log("Hello")
setTimeout(()=>{
    console.log("Hello world")
},2000)
console.log("World")


// მიუხედავად იმისა რომ Hello World უფრო ადრე დაიწერა ვიდრე World კონსოლში შემდეგი შედეგი დაგვხვდება:პირველი დაიბეჭდება Hello,შემდეგ World და საბოლოოდ I am Andria.ეს გამოწვეულია settimeout ის მეშვეობით.console.log("World") არ დაელოდა იმ 2 წამს რაც settimeout ს სჭირდებოდა console.log("Hello World") ს გასაშვებად რამაც გამოიწვია ესეთი შედეგი