num = int(input("Enter a number: "))
total = 1
for i in range(1,num+1):
    total *= i
print("The factorial is: " + str(total))
# აქ ჩვენ შემოვატანინეთ მომხარებელს რიცხვი და for ციკლის მეშვეობით გამოვთვალეთ მისი ფაქტორიალი ანუ ნამრავლი
# 1-დან მოცემულ რიცხვის ჩათვლით.


number = int(input("Enter a number: "))
for i in range(1, number + 1):
    if number % i == 0:
        print(i)
# აქ კი შემოვატანინეთ მომხმარებელს რიცხვი,for ციკლისა და if პირობის მეშვეობით შევამოწმეთ და შემდეგ დავბეჭდეთ
# ამ რიცხვის ყველა ისეთი გამყოფი რომელიც ნაშთს არ ტოვებს.
# ეს ყველაფერი % გამყოფის საშუალებით.% გამყოფი ჩვეულებრივი გაყოფისგან განსხვავდება იმით რომ პასუხს არა განაყოფს
# არამედ ნაშთს გვიბრუნებს.თუ ჩვენ გავყოფთ მაგალითად 10-ს 2-ზე პასუხს არა 5-ს არამედ 0-ს ანუ ნაშთს გვიბრუნებს.
# თუ გავყოფთ 10-ს 4-ზე პასუხი არ დაგვიბრუნდება ათწილადად არამედ დაგვიბრუნდება ნაშთი რომელიც 2-ი იქნება.
# ის გვეხმარება იმის გაგებაში იყოფა თუარა რიცხვი სხვა რიცხვზე,კენტია თუ ლუწი რიცხვი და ა.შ.
# გავიგოთ რიცხვი კენტია თუ ლუწი:
number1 = int(input("Enter a number: "))
if number1 % 2 == 0:
    print("The number is even.")
else:
    print("The number is odd.")
# მომხმარებელი შემოიტანს რიცხვს,რიცხვი თუ 2-ზე უნაშთოდ გაიყოფა ის ლუწი იქნება,ხოლო თუ არა კენტი.