#print არის ფუნქცია რომელიც გვეხმარება რაიმე ტექსტის ან მონაცემის ტერმინალში დაბეჭდვაში ხოლო მის ესევთქვათ გამოსაძახებლად საჭიროა ფრჩხილები რომლებშიც ჩავსვავთ სწორედ იმ ტექსტს რაც გვინდა რომ დაიბეჭდოს ტერმინალში.ფრჩხილების გარეშე print ფუნქცია არ მუშაობს.
#დეკლარაცია არის პროცესი რომლის მეშვეობითაც ჩვენ ვქმნით ცვლადს და ვანიჭებთ მას მნიშვნელობას რისი გამოყენებაც მოგვიანებით კოდის წერისას შეგვიძლია.ცვლადი არის იგივე საცავი რომელშიც ინახება ის ინფორმაცია რასაც ჩვენ მას მივაწვდით.

number=10
print(number)

number=20
print(number)

#ამ შემთხვევაში ცვლადის მნიშვნელობა თავდაპირველად იყო 10 მაგრამ მას შემდეგ რაც მას ჩვენ მნიშვნელობა შევუცვალეთ ინფორმაცია ცვლადში შეიცვალა და სწორედ ამიტომ დაიბეჭდა 10-ის მაგივრად 20.