# კომენტარი-კომენტარი არის ტექსტი რომელსაც პროგრამა არ კითხულობს და
# არ აღითქვამს მას რის გამოც მასში შეგვიძლია დავწეროთ ნებისმიერი ტექსტი
# თუნდაც ფუნქცია print("Hello World") ან ნებისმიერი სხვა.
# კომენტარის გამოსაყენებლად გამოიყენება სიმბოლო #
# კომენტარები გვეხმარება კოდის უკეთ გაგებაში და ორგანიზებაში.

# case-sensitive-ქეის სენსიტივი ნიშნავს იმას რომ პროგრამაში დიდი და პატარა ასოები განსხვავდება
# ანუ ჩვენ თუ შევქმნით ცვლადს სახელად name და შემდეგ print ფუნქციაში დავწერთ Name
# პროგრამა ამ ცვლადს ვერ იპოვის და კოდი გაჩერდება.
# მაგალითი:
name="John"
Name="Doe"
print(name)  # ეს გამოიტანს John-ს
print(Name)  # ეს კი გამოიტანს Doe-ს
# მაგრამ ჩვენ თუ დავწერთ print(NAME) ან print(naMe) პროგრამა ვერ იპოვის ასეთ ცვლადს და
# კოდი გაჩერდება.

# snake_case-ეს არის სტილი რომელიც გამოიყენება ძირითადად ცვლადების დასახელებისთვის
# როდესაც მასში რამდენიმე სიტყვაა.მაგალითად dogname ის მაგივრად შეგვიძლია დავწეროთ dog_name
# ან userage-ის მაგივრად user_age.ეს კოდის კითხვას ხდის უფრო მარტივს.

dogname="Buddy"
dog_name="Max"
print(dogname)   # ეს გამოიტანს Buddy-ს
print(dog_name)  # ეს კი გამოიტანს Max-ს
# როგორც ვხედავთ snake_case ის გამოყენებით შეიქმნა სხვა ცვლადი რომელიც უფრო მარტივად იკითხება.

# debbuging-დებაგინგი არის პროცესი რომლის დროსაც ჩვენ ვპოულობთ კოდში შეცდომებს და ვასწორებთ მათ.
# მაგალითად print("Hello World) ამ კოდში არის შეცდომა და აკლია დახურვის ბრჭყალი.
print("Hello World")  # ეს კოდი კი სწორია და გამოიტანს Hello World-ს.სწორედ ეს არის დებაგინგი.
#city = "London"
#pritn(City)
city = "London"
print(city)  # ეს კოდი კი სწორია და გამოიტანს London-ს. აქ შეცდომა პირველ რიგში იყო print-ი 
# რომელიც ეწერა არასწორად და ასევე იყო შეცდომა ფრჩხილებში.ფრჩხილებში უნდა ყოფილიყო city მაგრამ
# ჩვენ გვეწერა City რაც არასწორია case-sensitive-ის გამო.დებაგინგის შედეგად შესწორებული კოდი
# კი სწორია და მუშაობს.