#დეკლარაცია-დეკლარაცია არის მოქმედება რომელიც გვაძლევს საშუალებას შევქმნათ ცვლადი
#ინიციალიზება-ინიციალიზაცია არის მოქმედება რომელიც გვაძლევს საშუალებას ცვლადს მივანიჭოთ მნიშვნელობა
#რეინიციალიზება-რეინიციალიზაცია არის მოქმედება რომელიც გვაძლევს საშუალებას ცვლადს რომელიც უკვე არსებობს და აქვს მნიშვნელობა მინიჭებული მივანიჭოთ ახალი მნიშვნელობა

item="laptop"
print(item)

item="phone"
print(item)

item="tablet"
print(item)

number1=5
number2=7
number3=9
number4=15
number5=23

print(number1 + number2 + number3 + number4 + number5)

#გვაქვს მართკუთხედი რომლის სიგრძეა 10სმ ხოლო სიგანე 20სმ.გამოვთვალოთ მისი ფართობი
length=10
width=20
print(length*2 + width*2)
#ან
print(length + length + width + width)