# sequencing-ნიშნავს რაღაცის თანმიმდევრობით შესრულებას.მას ჩვენ python-ში ვხვდებით.
# ჩვენ მიერ დაწერილი კოდი იკითხება ზემოდან ქვემოთ, შესაბამისად ყოველი ბრძანება შესრულდება
# მისი წინა ბრძანების შესრულების შემდეგ.მაგალითად:
print("Hello")
print("World")
# აქ პირველი print("Hello") ბრძანება შესრულდება და შემდეგ მეორე print("World") ბრძანება.


# iteration-იტერაცია ნიშნავს რაღაცის გამეორებას.ვთქვათ ჩვენ გამოვიყენეთ print ბრძანება ერთი
# ტექსტის გამოსატანად რამდენჯერმე,მაგალითად:
print("Hello")
print("Hello")
print("Hello")
# აქ ჩვენ სამჯერ გამოვიყენეთ print("Hello") ბრძანება, რაც ნიშნავს იმას რომ ჩვენ სამჯერ გავიმეორეთ
# ერთი და იგივე მოქმედება.ჩვენ სამჯერ მოვახდინეთ იტერაცია.


# selection-ნიშნავს არჩევანის გაკეთებას.კომპიუტერს შეუძლია გააკეთოს არჩევანი თავისით.მაგალითად
# როდესაც ჩვენ რიცხვებს ვადარებთ ერთმანეთს კომპიუტერი ირჩევს ეს შედარება სწორია თუ არა.
# მაგალითად:
a = 5
b = 10
print(a < b)
# აქ კომპიუტერი ხედავს რომ a ნაკლებია b-ზე და შესაბამისად print ბრძანება გამოიტანს ტერმინალში True-ს.
# თუ ჩვენ გვექნება არასწორი შედარება:
print(a > b)
# აქ კომპიუტერი ხედავს რომ a არ არის მეტი b-ზე და შესაბამისად print ბრძანება გამოიტანს ტერმინალში False-ს.


# ალგორითმი-ალგორითმი ჩვენ ყოველდღიურად გვხვდება ცხოვრებაში.მაგალითად როდესაც ჩვენ
# სკოლაში მივდივართ ვიცით თუ რა უნდა გავაკეთოთ,ვიცით რომ უნდა გავიღვიძოთ,მოვწესრიგდეთ,
# ჩავიცვათ,მივირთვათ,ავიღოთ ჩანთა,წავიდეთ და ა.შ.ეს ყველაფერი არის ალგორითმი.
# ალგორითმი არის ნაბიჯების თანმიმდევრობა,რომელსაც ჩვენ ვასრულებთ გარკვეული მიზნის მისაღწევად.
# ალგორითმები შეიძლება იყოს ძალიან მარტივი ან ძალიან კომპლექსური,მაგალითად:
# მარტივი ალგორითმი შეიძლება იყოს რეცეპტი საჭმლის მოსამზადებლად, ხოლო კომპლექსური ალგორითმი
# შეიძლება იყოს კომპიუტერული პროგრამა, რომელიც ასრულებს რთულ ამოცანებს.


# ალგორითმის გამოსახვა ჩვენ რამდენიმე გზით შეგვიძლია.ესენია:
# 1.flow chart-ეს არის გრაფიკული გამოსახვა ალგორითმის,ჩვენ პატარა ნახატით ავსახავთ თუ რა გზას
# გავდივართ ან რა გზას გადის კომპიუტერი მიზნის მისაღწევად.
# 2.pseudocode-ეს არის ალგორითმის ტექსტური გამოსახვა,რომელიც არც პროგრამირების ენაა და არც
# ჩვეულებრივი ენა.ეს არის რაღაც ამ ორს შუაში და გამოიყენება ისევ ალგორითმის აღწერისთვის ნაბიჯების
# აღწერისთვის.
# 3.natural language-ეს არის ალგორითმის აღწერა ჩვეულებრივი ენით რომელსაც ვიყენებთ ყოველდღიურად.


# შევქმნათ პროგრამა რომელშიც მომხმარებელმა უნდა შემოიყვანოს სახელი.თუ მომხმარებლის შემოყვანილი
# სახელი დაემთხვევა "admin"-ს მაშინ პროგრამა გამოიტანს terminal ში True-ს, წინააღმდეგ
# შემთხვევაში False-ს.
name = input("Enter your name: ")
our_name = "admin"
print(name == our_name)
# ახლა კი აღვწეროთ თუ როგორ მუშაობს ეს პროგრამა:
# 1.პროგრამა თხოვს მომხმარებელს შეიყვანოს სახელი.
# 2.მომხმარებელი შეაქვს სახელი და პროგრამა ინახავს მას name ცვლადში.
# 3.პროგრამა შეადარებს name ცვლადში შენახულ სახელს "admin"-ს.
# 4.თუ name ცვლადში შენახული სახელი ემთხვევა "admin"-ს, პროგრამა გამოიტანს terminal ში True-ს.
# 5.თუ name ცვლადში შენახული სახელი არ ემთხვევა "admin"-ს, პროგრამა გამოიტანს terminal ში False-ს.
# ეს პროგრამა იყენებს sequencing-ს, რადგან ბრძანებები სრულდება ზემოდან ქვემოთ.
# ასევე იყენებს selection-ს, რადგან პროგრამა აკეთებს არჩევანს იმის მიხედვით მომხმარებლის მიერ 
# შემოყვანილი სახელი ემთხვევა "admin"-ს.