# print-ფუნქცია რომელსაც გამოაქვს ტერმინალში ის რასაც მას გადავცემთ
print("Hello World")
# ცვლადი არის ერთგვარი საცავი რომელშიც ვინახავთ ინფორმაციას რომელის შემდეგ მრავალჯერ გამოყენება შეგვიძლია
name="Andria"
# for loop-გამოიყენება მაშინ როდესაც ჩვენ ვიცით იტერაციების რაოდენობა.გადაეცემა range ფუნქციით რიცხვთა დიაპაზონი
for i in range(1,10):
    print(i)       
# while loop-გამოიყენება მაშინ როდესაც იტერაციების რაოდენობა არვიცით.გადაეცემა ისეთი მნიშვნელობა რომელიც იტერაციების დროს ნელ-ნელა
# შეიცვლება.while loop მუშაობს მანამ სანამ მისთვის გადაცემული მნიშვნელობა სწორია.თუ ეს მნიშვნელობა არ შეიცვალა და არასწორი არ გახდა
# loop უსასრულო იქნება
num=1
while num<20:
    print(num)
    num+=1
# list-სია არის ერთ-ერთი მონაცემთა ტიპი რომელშიც შეგვიძლია მრავალი სხვადასხვა ტიპის მონაცემის შენახვა
names=["andria","saba","luka"]
# indexing-ინდექსი თითოეულ სიის ელემენტს თავისი აქვს.ინდექსები იწყება 0 იდან შესაბამისად სიის პირველი ელემენტი არის ინდექსით 0
print(names[0])
# slicing-slicing ის საშუალებით სიის გარკვეული ნაწილის გამოტანა შეგვიძლია.გადაეცემა მას ინდექსები
print(names[0:2])
# list ფუნქციები-python ში გვაქვს built in სიის ფუნქციები .insert,.append,.pop და ა.შ
names.insert(0,"nika")
# insert ის საშუალებით ჩვენ ჩვენს სასურველ index ზე დავამატებთ ელემენტს
names.append("dato")
# append ის საშუალებით სიის ბოლოში შეგვიძლია დავამატოთ ჩვენი სასურველი ინფორმაცია
# tuple-list ისგან განსხვავებით მისი შეცვლა შექმნის შემდეგ არ შეგვიძლია
names2=("andria","nika")
# set-სეტები განსხვავდება list ებისგან იმით რომ მასში ერთნაირი ელემენტები არ გვხვდება და არ გააჩნია ინდექსინგი
set1={5,2,3}
# ლოგიკური ოპერატორები(and,or,not)
# and-უნდა იყოს ორივე პირობა true რომ დააბრუნოს true
# or-ერთერთი მაინც თუ არის true დააბრუნებს true-ს
# not-აბრუნებს საპირისპიროს