// npm init ს ვიყენებთ მაშინ როდესაც ახალ პროექტს ვიწყებთ რომ შევქმნათ ფაილი package.json.
// package.json ი კი ინახავს პროექტის შესახებ ინფორმაციას და ასევე dependencies სადაც მოქცეულია ყველა ის ბიბლიოთეკა რომელიც ამ პროექტში გადმოვწერეთ

// commonjs უფრო ძველია და გამოიყენება უფრო ხშირად backend ში.ერთ-ერთი მთავარი განსხვავება მათ შორის არის სინტაქსი.commonjs ის დროს ვიყენებთ module.exports/require ხოლო es6 ის დროს import/export ს.ასევე განსხვავდება იმით რომ es6 ს აქვს export default რაც მხოლოდ ერთი კონკრეტული ინფორმაციის გადმოსატანად გამოიყენება რომელსაც შემდგომ იმპორტისას შეგვიძლია სახელი შევუცვალოთ

import superhero from '@fakerjs/superhero';

console.log(superhero())